In [183]:
import pandas as pd

In [184]:
df = pd.DataFrame(
    {
        "Name" : ["Diane", "Floriane", "Hayath", "Senami"],
        "Age" : [22,25,18,26],
        "Note" : [15, 5, 18, 13]
    }
)

In [185]:
df

       Name  Age  Note
0     Diane   22    15
1  Floriane   25     5
2    Hayath   18    18
3    Senami   26    13

In [186]:
ages = pd.Series([22,35,54], name ="Age")

In [187]:
ages

0    22
1    35
2    54
Name: Age, dtype: int64

In [188]:
df.dtypes

Name    object
Age      int64
Note     int64
dtype: object

In [189]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Note    4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [190]:
df[["Age","Name"]].shape

(4, 2)

In [191]:
df[df["Age"] > 25]

     Name  Age  Note
3  Senami   26    13

In [192]:
df

       Name  Age  Note
0     Diane   22    15
1  Floriane   25     5
2    Hayath   18    18
3    Senami   26    13

In [193]:
df[df["Note"].isin([5,18])]

       Name  Age  Note
1  Floriane   25     5
2    Hayath   18    18

In [194]:
df.isna()

    Name    Age   Note
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [195]:
df.loc[df["Age"] > 25, "Name"]

3    Senami
Name: Name, dtype: object

### Attribut - Method - Argument
df.shape : Attribut
df.info() : Method
df.head(3) : Argument

In [196]:
df

       Name  Age  Note
0     Diane   22    15
1  Floriane   25     5
2    Hayath   18    18
3    Senami   26    13

In [197]:
df = df.rename(columns={"Name": "Nom"})

In [198]:
df.rename(columns=str.upper)

        NOM  AGE  NOTE
0     Diane   22    15
1  Floriane   25     5
2    Hayath   18    18
3    Senami   26    13

In [199]:
df[["Note","Age"]].median()

Note    14.0
Age     23.5
dtype: float64

In [200]:
df[["Note","Age"]].describe()

            Note        Age
count   4.000000   4.000000
mean   12.750000  22.750000
std     5.560276   3.593976
min     5.000000  18.000000
25%    11.000000  21.000000
50%    14.000000  23.500000
75%    15.750000  25.250000
max    18.000000  26.000000

In [201]:
df[["Note","Age"]].skew()

Note   -1.199789
Age    -0.888584
dtype: float64

In [202]:
df["Teint"] = ["Bronzé","Noire","Noire","Noire"]

In [203]:
df

        Nom  Age  Note   Teint
0     Diane   22    15  Bronzé
1  Floriane   25     5   Noire
2    Hayath   18    18   Noire
3    Senami   26    13   Noire

In [204]:
df[['Teint', 'Note']].groupby('Teint').mean()

        Note
Teint
Bronzé  15.0
Noire   12.0

In [205]:
df

        Nom  Age  Note   Teint
0     Diane   22    15  Bronzé
1  Floriane   25     5   Noire
2    Hayath   18    18   Noire
3    Senami   26    13   Noire

In [206]:
df.sort_values(by=["Age","Note"])

        Nom  Age  Note   Teint
2    Hayath   18    18   Noire
0     Diane   22    15  Bronzé
1  Floriane   25     5   Noire
3    Senami   26    13   Noire

In [207]:
df.sort_index()

        Nom  Age  Note   Teint
0     Diane   22    15  Bronzé
1  Floriane   25     5   Noire
2    Hayath   18    18   Noire
3    Senami   26    13   Noire

In [208]:
df.pivot(columns="Teint", values="Nom")

Teint Bronzé     Noire
0      Diane       NaN
1        NaN  Floriane
2        NaN    Hayath
3        NaN    Senami